attached_assets/Pasted--k6-run-scenarios-smoke-js-BASE-URL-https-drafthub-web-_1785134913382.txt
▶ k6 run scenarios/smoke.js
BASE_URL=https://drafthub-web.vercel.app
TEST_COMMUNITY_ID=2d98706f-367c-441b-9d5d-ace92fa8a859
CONCURRENT_VUS=50
/\ Grafana /‾‾/
/\ / \ |\ __ / /
/ \/ \ | |/ / / ‾‾\
/ \ | ( | (‾) |
/ __________ \ |_|\_\ \_____/
execution: local
script: /Users/sachin/Documents/GitHub/drafthub/k6/scenarios/smoke.js
output: -
scenarios: (100.00%) 1 scenario, 1 max VUs, 10m30s max duration (incl. graceful stop):
* default: 1 iterations shared among 1 VUs (maxDuration: 10m0s, gracefulStop: 30s)
running (00m01.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default [ 0% ] 1 VUs 00m01.0s/10m0s 0/1 shared iters
running (00m02.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default [ 0% ] 1 VUs 00m02.0s/10m0s 0/1 shared iters
running (00m03.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default [ 0% ] 1 VUs 00m03.0s/10m0s 0/1 shared iters
running (00m04.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default [ 0% ] 1 VUs 00m04.0s/10m0s 0/1 shared iters
running (00m05.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default [ 0% ] 1 VUs 00m05.0s/10m0s 0/1 shared iters
running (00m06.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default [ 0% ] 1 VUs 00m06.0s/10m0s 0/1 shared iters
running (00m07.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default [ 0% ] 1 VUs 00m07.0s/10m0s 0/1 shared iters
running (00m08.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default [ 0% ] 1 VUs 00m08.0s/10m0s 0/1 shared iters
running (00m09.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default [ 0% ] 1 VUs 00m09.0s/10m0s 0/1 shared iters
running (00m10.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default [ 0% ] 1 VUs 00m10.0s/10m0s 0/1 shared iters
running (00m11.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default [ 0% ] 1 VUs 00m11.0s/10m0s 0/1 shared iters
running (00m12.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default [ 0% ] 1 VUs 00m12.0s/10m0s 0/1 shared iters
running (00m13.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default [ 0% ] 1 VUs 00m13.0s/10m0s 0/1 shared iters
running (00m14.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default [ 0% ] 1 VUs 00m14.0s/10m0s 0/1 shared iters
running (00m15.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default [ 0% ] 1 VUs 00m15.0s/10m0s 0/1 shared iters
running (00m16.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default [ 0% ] 1 VUs 00m16.0s/10m0s 0/1 shared iters
running (00m17.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default [ 0% ] 1 VUs 00m17.0s/10m0s 0/1 shared iters
running (00m18.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default [ 0% ] 1 VUs 00m18.0s/10m0s 0/1 shared iters
running (00m19.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default [ 0% ] 1 VUs 00m19.0s/10m0s 0/1 shared iters
running (00m20.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default [ 0% ] 1 VUs 00m20.0s/10m0s 0/1 shared iters
running (00m21.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default [ 0% ] 1 VUs 00m21.0s/10m0s 0/1 shared iters
running (00m22.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default [ 0% ] 1 VUs 00m22.0s/10m0s 0/1 shared iters
running (00m23.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default [ 0% ] 1 VUs 00m23.0s/10m0s 0/1 shared iters
running (00m24.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default [ 0% ] 1 VUs 00m24.0s/10m0s 0/1 shared iters
running (00m25.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default [ 0% ] 1 VUs 00m25.0s/10m0s 0/1 shared iters
running (00m26.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default [ 0% ] 1 VUs 00m26.0s/10m0s 0/1 shared iters
running (00m27.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default [ 0% ] 1 VUs 00m27.0s/10m0s 0/1 shared iters
running (00m28.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default [ 0% ] 1 VUs 00m28.0s/10m0s 0/1 shared iters
running (00m29.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default [ 0% ] 1 VUs 00m29.0s/10m0s 0/1 shared iters
running (00m30.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default [ 0% ] 1 VUs 00m30.0s/10m0s 0/1 shared iters
running (00m31.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default [ 0% ] 1 VUs 00m31.0s/10m0s 0/1 shared iters
running (00m32.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default [ 0% ] 1 VUs 00m32.0s/10m0s 0/1 shared iters
running (00m33.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default [ 0% ] 1 VUs 00m33.0s/10m0s 0/1 shared iters
running (00m34.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default [ 0% ] 1 VUs 00m34.0s/10m0s 0/1 shared iters
running (00m35.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default [ 0% ] 1 VUs 00m35.0s/10m0s 0/1 shared iters
running (00m36.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default [ 0% ] 1 VUs 00m36.0s/10m0s 0/1 shared iters
running (00m37.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default [ 0% ] 1 VUs 00m37.0s/10m0s 0/1 shared iters
running (00m38.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default [ 0% ] 1 VUs 00m38.0s/10m0s 0/1 shared iters
█ THRESHOLDS
checks
✗ 'rate>0.95' rate=47.36%
http_req_duration
✓ 'p(95)<2000' p(95)=1.3s
{percentile:99}
✓ 'p(99)<5000' p(99)=0s
http_req_failed
✗ 'rate<0.20' rate=58.92%
█ TOTAL RESULTS
checks_total.......: 76 1.989876/s
checks_succeeded...: 47.36% 36 out of 76
checks_failed......: 52.63% 40 out of 76
✓ data/cities: status 200
✓ data/cities: body has cities array
✓ data/companies: status 200
✓ data/companies: body has companies array
✓ data/sectors: status 200
✓ data/sectors: body has sectors array
✓ data/interests: status 200
✓ data/interests: body has interests array
✓ data/experience-levels: status 200
✓ data/experience-levels: body has experience_levels array
✓ giphy/trending: status 200 or 429 or 502 or 503
✓ giphy/search: status 200 or 429 or 502 or 503
✓ applications/submit: accepted or rate-limited
✓ applications/submit invalid: status 400 or 422
✓ admin/guard: 401 or 403
✗ login: status 200 or 429
↳ 0% — ✓ 0 / ✗ 1
✗ login: success true (when not rate-limited)
↳ 0% — ✓ 0 / ✗ 1
✓ auth/me authed: status 200
✗ auth/me authed: user present
↳ 0% — ✓ 0 / ✗ 1
✓ auth/login invalid: status 401 or 400 or 422 or 429
✓ auth/reset-request: status 200 or 429
✓ auth/me unauthed: status 200
✓ auth/me unauthed: no active user
✗ communities/list: status 200
↳ 0% — ✓ 0 / ✗ 1
✗ communities/list: has communities array
↳ 0% — ✓ 0 / ✗ 1
✗ communities/all: status 200
↳ 0% — ✓ 0 / ✗ 1
✗ communities/single: status 200 or 404
↳ 0% — ✓ 0 / ✗ 1
✗ communities/stats: status 200 or 404
↳ 0% — ✓ 0 / ✗ 1
✗ communities/messages-get: status 200 or 404
↳ 0% — ✓ 0 / ✗ 1
✗ communities/messages-post: status 200 or 201 or 404
↳ 0% — ✓ 0 / ✗ 1
✗ communities/read-patch: status 200 or 404
↳ 0% — ✓ 0 / ✗ 1
✗ chat/messages-get: status 200
↳ 0% — ✓ 0 / ✗ 1
✗ chat/messages-get: has messages array
↳ 0% — ✓ 0 / ✗ 1
✗ chat/messages-post: status 201
↳ 0% — ✓ 0 / ✗ 1
✗ chat/messages-post: has message id
↳ 0% — ✓ 0 / ✗ 1
✗ chat/messages-post: message has content
↳ 0% — ✓ 0 / ✗ 1
✗ chat/messages-post: message has user
↳ 0% — ✓ 0 / ✗ 1
✗ chat/messages-post: reactions array present
↳ 0% — ✓ 0 / ✗ 1
✗ chat/messages-burst: 201 or 429
↳ 0% — ✓ 0 / ✗ 4
✗ chat/read-patch: status 200
↳ 0% — ✓ 0 / ✗ 1
✗ chat/read-patch: ok true
↳ 0% — ✓ 0 / ✗ 1
✗ chat/read-patch: has previousLastReadAt key
↳ 0% — ✓ 0 / ✗ 1
✗ chat/stats-get: status 200
↳ 0% — ✓ 0 / ✗ 1
✗ chat/stats-get: has posts_today
↳ 0% — ✓ 0 / ✗ 1
✗ chat/messages-post-empty: rejected (400/422/429)
↳ 0% — ✓ 0 / ✗ 1
✗ chat/messages-post-toolong: rejected (400/422/429)
↳ 0% — ✓ 0 / ✗ 1
✗ threads/list: status 200 or 404
↳ 0% — ✓ 0 / ✗ 1
✗ threads/create: status 2xx or 404
↳ 0% — ✓ 0 / ✗ 1
✗ events/list: status 200 or 404
↳ 0% — ✓ 0 / ✗ 1
✗ events/create: status 2xx or 404
↳ 0% — ✓ 0 / ✗ 1
✗ profile/get: status 200
↳ 0% — ✓ 0 / ✗ 1
✗ profile/get: has user object
↳ 0% — ✓ 0 / ✗ 1
✗ profile/get: has profile object
↳ 0% — ✓ 0 / ✗ 1
✗ profile/patch: status 200
↳ 0% — ✓ 0 / ✗ 1
✗ profile/interests: status 2xx
↳ 0% — ✓ 0 / ✗ 1
✗ profile/threads: status 200
↳ 0% — ✓ 0 / ✗ 1
✗ lottie-settings/get: status 200
↳ 0% — ✓ 0 / ✗ 1
✓ link-preview/get: status 200 or 4xx
✓ logout: status 200
✓ admin login: status 200 or 429
✓ admin login: success true (when not rate-limited)
✓ admin/applications: status 200 or 401
✓ admin/users: status 200 or 401
✓ admin/communities: status 200 or 401
✓ admin/cities: status 200 or 401
✓ admin/sectors: status 200 or 401
✓ admin/companies: status 200 or 401
✓ admin/interests: status 200 or 401
✓ admin/moderation: status 200 or 401
✓ admin/tags: status 200 or 401
✓ admin/cities-post: status 2xx or 401
✓ admin/interests-post: status 2xx or 401
HTTP
http_req_duration..............: avg=533.33ms min=246.62ms med=356.89ms max=1.91s p(90)=993.42ms p(95)=1.3s
{ expected_response:true }...: avg=797.49ms min=271.12ms med=566.52ms max=1.91s p(90)=1.71s p(95)=1.88s
{ percentile:99 }............: avg=0s min=0s med=0s max=0s p(90)=0s p(95)=0s
http_req_failed................: 58.92% 33 out of 56
http_reqs......................: 56 1.466225/s
EXECUTION
iteration_duration.............: avg=38.19s min=38.19s med=38.19s max=38.19s p(90)=38.19s p(95)=38.19s
iterations.....................: 1 0.026183/s
vus............................: 1 min=1 max=1
vus_max........................: 1 min=1 max=1
NETWORK
data_received..................: 97 kB 2.6 kB/s
data_sent......................: 9.4 kB 246 B/s
running (00m38.2s), 0/1 VUs, 1 complete and 0 interrupted iterations
default ✓ [ 100% ] 1 VUs 00m38.2s/10m0s 1/1 shared iters
time="2026-07-27T12:18:22+05:30" level=error msg="thresholds on metrics 'checks, http_req_failed' have been crossed"
❌ Exited with code 99