attached_assets/Pasted-sachin-sachins-MacBook-Air-2-drafthub-k6-run-k6-scenari_1785095883539.txt
sachin@sachins-MacBook-Air-2 drafthub % k6 run k6/scenarios/smoke.js \
  -e BASE_URL=https://drafthub-web.vercel.app \
  -e ADMIN_EMAIL=admin@drafthub.com \
  -e ADMIN_PASSWORD=sachingalaxy1228@ \
  -e TEST_USER_EMAIL=patilsachin1228@gmail.com \
  -e TEST_USER_PASSWORD=sachin1228 \
  -e TEST_COMMUNITY_ID=2d98706f-367c-441b-9d5d-ace92fa8a859

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6/scenarios/smoke.js
        output: -

     scenarios: (100.00%) 1 scenario, 1 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 1 iterations shared among 1 VUs (maxDuration: 10m0s, gracefulStop: 30s)



  █ THRESHOLDS 

    checks
    ✗ 'rate>0.95' rate=40.42%

    http_req_duration
    ✓ 'p(95)<2000' p(95)=1.53s

      {percentile:99}
      ✓ 'p(99)<5000' p(99)=0s

    http_req_failed
    ✗ 'rate<0.05' rate=64.70%


  █ TOTAL RESULTS 

    checks_total.......: 47     1.993342/s
    checks_succeeded...: 40.42% 19 out of 47
    checks_failed......: 59.57% 28 out of 47

    ✓ data/cities: status 200
    ✗ data/cities: body is array
      ↳  0% — ✓ 0 / ✗ 1
    ✓ data/companies: status 200
    ✗ data/companies: body is array
      ↳  0% — ✓ 0 / ✗ 1
    ✓ data/sectors: status 200
    ✗ data/sectors: body is array
      ↳  0% — ✓ 0 / ✗ 1
    ✓ data/interests: status 200
    ✗ data/interests: body is array
      ↳  0% — ✓ 0 / ✗ 1
    ✓ data/experience-levels: status 200
    ✗ data/experience-levels: body is array
      ↳  0% — ✓ 0 / ✗ 1
    ✗ giphy/trending: status 200 or 429
      ↳  0% — ✓ 0 / ✗ 1
    ✗ giphy/search: status 200 or 429
      ↳  0% — ✓ 0 / ✗ 1
    ✓ applications/submit: accepted or rate-limited
    ✓ applications/submit invalid: status 400 or 422
    ✓ admin/guard: 401 or 403
    ✓ login: status 200
    ✗ login: has user in body
      ↳  0% — ✓ 0 / ✗ 2
    ✓ auth/me authed: status 200
    ✓ auth/me authed: user present
    ✓ logout: status 200
    ✓ auth/me unauthed: status 200
    ✓ auth/me unauthed: user null
    ✓ auth/login invalid: status 401 or 400
    ✓ auth/reset-request: status 200 or 429
    ✗ communities/list: status 200
      ↳  0% — ✓ 0 / ✗ 1
    ✗ communities/list: body is array
      ↳  0% — ✓ 0 / ✗ 1
    ✗ communities/all: status 200
      ↳  0% — ✓ 0 / ✗ 1
    ✗ communities/single: status 200 or 404
      ↳  0% — ✓ 0 / ✗ 1
    ✗ communities/stats: status 200 or 404
      ↳  0% — ✓ 0 / ✗ 1
    ✗ communities/messages-get: status 200 or 404
      ↳  0% — ✓ 0 / ✗ 1
    ✗ communities/messages-post: status 200 or 201 or 404
      ↳  0% — ✓ 0 / ✗ 1
    ✗ communities/read-patch: status 200 or 404
      ↳  0% — ✓ 0 / ✗ 1
    ✗ threads/list: status 200 or 404
      ↳  0% — ✓ 0 / ✗ 1
    ✗ threads/create: status 2xx or 404
      ↳  0% — ✓ 0 / ✗ 1
    ✗ events/list: status 200 or 404
      ↳  0% — ✓ 0 / ✗ 1
    ✗ events/create: status 2xx or 404
      ↳  0% — ✓ 0 / ✗ 1
    ✗ profile/get: status 200
      ↳  0% — ✓ 0 / ✗ 1
    ✓ profile/get: body is object
    ✗ profile/get: has key 'id'
      ↳  0% — ✓ 0 / ✗ 1
    ✗ profile/get: has key 'name'
      ↳  0% — ✓ 0 / ✗ 1
    ✗ profile/patch: status 200
      ↳  0% — ✓ 0 / ✗ 1
    ✗ profile/interests: status 2xx
      ↳  0% — ✓ 0 / ✗ 1
    ✗ profile/threads: status 200
      ↳  0% — ✓ 0 / ✗ 1
    ✗ lottie-settings/get: status 200
      ↳  0% — ✓ 0 / ✗ 1
    ✓ link-preview/get: status 200 or 4xx

    HTTP
    http_req_duration..............: avg=535.59ms min=239.83ms med=308.12ms max=2.34s p(90)=1.03s p(95)=1.53s
      { expected_response:true }...: avg=928.98ms min=282.98ms med=653.81ms max=2.34s p(90)=1.53s p(95)=1.9s 
      { percentile:99 }............: avg=0s       min=0s       med=0s       max=0s    p(90)=0s    p(95)=0s   
    http_req_failed................: 64.70% 22 out of 34
    http_reqs......................: 34     1.441992/s

    EXECUTION
    vus............................: 1      min=1        max=1
    vus_max........................: 1      min=1        max=1

    NETWORK
    data_received..................: 28 kB  1.2 kB/s
    data_sent......................: 5.6 kB 237 B/s



running (00m23.6s), 0/1 VUs, 0 complete and 1 interrupted iterations
default ✗ [--------------------------------------] 1 VUs  00m23.6s/10m0s  0/1 shared iters
ERRO[0024] test run was aborted because k6 received a 'interrupt' signal 
sachin@sachins-MacBook-Air-2 drafthub %